app/controllers/songs_controller.rb

  def index
    artist = Artist.find_by(id: params[:artist_id])
    if artist
      @songs = artist.songs
    elsif params[:artist_id] && !artist
      redirect_to artists_path, alert: "Artist not found."
    else
      @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]

  def show
    @song = Song.find_by(id: params[:id])
    @artist = Artist.find_by(id: params[:artist_id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]